laminar-pipe-flow/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet          
    {
		type            fixedValue; // inflow velocity
        value			uniform (0 0.005 0);
    }

	outlet          
    {
        type            zeroGradient;
		
    }
	
	wall
	{
		type 			noSlip;
	}

	axis
    {
        type 			empty;
    }

	front
    {
        type 			wedge;
    }

	 back
    {
        type 			wedge;
    }
	

	

}

// ************************************************************************* //
