laminar-pipe-flow/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       5870;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       5900;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       5930;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3000;
        startFace       5930;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          3000;
        startFace       8930;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       11930;
    }
)

// ************************************************************************* //
