laminar-pipe-flow/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
 
vertices
(
    (0 0 0)
    (0.00414 0 0.0949)
    (-0.00414 0 0.0949) 
    (0 1.2 0) 
    (0.00414 1.2 0.0949) 
    (-0.00414 1.2 0.0949)
);
 
blocks
(
hex (0 0 3 3 2 1 4 5) (1 100 30) simpleGrading (1 1 0.35) // 
);

// TODO create arc for wall
edges           
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 0) //
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (3 5 4 3) //
        );
    }

    axis
    {
        type empty;
        faces
        (
            (3 3 0 0) //
        );
    }

    front
    {
        type wedge;
        faces
        (
            (0 3 4 1) 
        );
    }

    back
    {
        type wedge;
        faces
        (
            (2 5 3 0)
        );
    }
	
	wall
	{
		type wall;
		faces
		(
			(1 4 5 2)
		);
	}
);
